# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не настолько просто, 
# насколько легко он их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов 
# (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов, 
# то они разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает в программу с клавиатуры. 
# В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

# *Пример:*

# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да    
#     **Вывод:** Парам пам-пам  

stih = input("Стих: ").split(' ')
check = 'аеёиоуыэюя'

def rythm(stih, check):
    count = set()
    for i in stih:
        str = i
        sum = 0
        for j in str:
             if j in check:
                 sum+=1
        count.add(sum)
    if len(count) == 1:
        print("Парам пам-пам")
    else:
        print("Пам парам")

rythm(stih,check)